#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops/runs/run-My6CDYK4reNkkb4v

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
random_string.suffix: Refreshing state... [id=PvJaEFg9]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075b2168a8a54d959]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=education-eks-PvJaEFg920210822032427561500000002]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::112227029085:policy/education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=education-eks-PvJaEFg920210822032427561500000002-20210822032427946300000003]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=education-eks-PvJaEFg920210822032427561500000002-20210822032427951300000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=education-eks-PvJaEFg920210822032427561500000002-20210822032427956300000006]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=education-eks-PvJaEFg920210822032427561500000002-20210822032427952800000005]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b18743b4b7302c8f]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-081c66a871fd32313]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-00a9df337c017e67f]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0756b0a6cb6110a30]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d825833703ae3e8]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0ace5e5f6e3ccd24f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02b7b75b8875b6f02]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06dff361d9daa34ea]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a134ea213c4bf0e2]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-034198ad97290fcd6]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0374fd609632adf7d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-073345847327cab44]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00dd6ad17f28e0110]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aff3cd4393d112eb]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06028b53eb644fe96]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-1141829673]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-3753062006]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-197806921]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-829459839]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d825833703ae3e81080289494]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-869694342]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-613902773]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-051a53cf34f3bab1d]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029613a7fdccb2696]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba0c71fe59a51981]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08033d4efa6dd5d4d]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05b5a62b36b141900]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07bcd2960e6d0ee52]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04417febfdd4b1957]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=education-eks-PvJaEFg9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06028b53eb644fe961080289494]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=education-eks-PvJaEFg92021082203341714260000000c]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=63afa7551a03cd4e0d8ba3c67e6d918bbf23bf1b]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=education-eks-PvJaEFg92021082203341737680000000e]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=education-eks-PvJaEFg92021082203341714260000000c-20210822033417439900000010]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=education-eks-PvJaEFg92021082203341714260000000c-2021082203341743730000000f]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=education-eks-PvJaEFg92021082203341714260000000c-20210822033417446700000011]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=education-eks-PvJaEFg92021082203341736640000000d]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=education-eks-PvJaEFg9-worker-group-120210822033417686400000013]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=education-eks-PvJaEFg9-worker-group-220210822033417683300000012]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=education-eks-PvJaEFg9-worker-group-220210822033428157800000014]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=education-eks-PvJaEFg9-worker-group-120210822033428188600000015]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/education-eks-PvJaEFg9" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNakF6TXpBek4xb1hEVE14TURneU1EQXpNekF6TjFvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBT01PCmVTbzJGblhYZzRMTHQxMXZPaS9EWFoySTd1N3VaTEZIYTM4dXR6THA3eEUrckk4NkhHTW92ZGpGMENVNCtuQksKZzMxWUdCTWdIUnVraFBxVlcrR3llZFBBekpmb0tCY08rdHRJYnBsUHdlZHlYekJWejdxK3Z6bU5ZRHBNNGIzNApwSThsWFhSVTNkOTdJMGhJZGNyKzIzeDNON1drZytKVldQWlg1YktRbzdUSHZLWW1IZ3NPUDNTTU8wR1pwbkQrCkNkMVBJTWh2dXdBZzJZb1Jyc0h2a285SFJkU3Vmc1I3YjB1Qnh5RU1jZVFGWEVvNVF3T1BPcjFxRzY5a0NxMlgKSytJbXlVUmdiYWE4N2ZnL2R6QURIV0dsUWF2OWlvV3pQSHhKVzNuaXczb0IwNEZpc2lCZmVSMkNLSGZNSHJRSApUcVhpN2VIVzhPR3E1UEVHa0g4Q0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZKSkRpdzA4TUgvSmtoM1NTbEc3U3BqT3NOOFdNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCeG0rUVZXZG5FRGZVOWt5R3VUZm9ZS0p5TnhTdGZlZ28wbmFhMDU5azAzVW1CSGlvRApES25aMU1KNjBkZW1wcHdvdXJPaUZwL1BpcmpXRFVxT1lOajB5cGVBclluRkhIWnlreU0wcTVqbUZrdm5xK05XCitld2NGY1F4dU1EQWRUVVFLN2V6NjlTVi84QWxLMmtRdGdBcldUVi9JUU5ybGFQVDV1M3lwQjUvN0VpYVJEWWkKM3pmZDZJdWVMUS82T2g1cml4aXpaVTZCUXErYUh5VFNOSnQrUjIrVi92bFlIL1BCcTdScDl1U2JWclo5VCtnZApuUkVZYkMvOWNhN2ZFK0RrZlBpeCtVL08zZTVzVzJNdnhPYW5hTjZUZDA3MG9pYWh5K3RybWw1Rnlic1F4d25XCjI2M00xTTUzSjZxQmZqZHFrS0JiVHJGNmRQaE5mRzZDc3JzcwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-22 03:25:02.389 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [] -> (known after apply)
      ~ endpoint                  = "https://FCB0A2152642084A5018EBE93CEDF683.gr7.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "education-eks-PvJaEFg9" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/FCB0A2152642084A5018EBE93CEDF683"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
      ~ name                      = "education-eks-PvJaEFg9" -> (known after apply)
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::112227029085:role/education-eks-PvJaEFg920210822032427561500000002" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "Environment" = "training"
          - "GithubOrg"   = "terraform-aws-modules"
          - "GithubRepo"  = "terraform-aws-eks"
        } -> (known after apply)
      ~ version                   = "1.20" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "sg-00eb47d6cac3485fe"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-0ace5e5f6e3ccd24f",
                ]
              - subnet_ids                = [
                  - "subnet-02b7b75b8875b6f02",
                  - "subnet-06dff361d9daa34ea",
                  - "subnet-0a134ea213c4bf0e2",
                ]
              - vpc_id                    = "vpc-075b2168a8a54d959"
            },
        ] -> (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      ~ id    = "education-eks-PvJaEFg9" -> (known after apply)
      ~ name  = "education-eks-PvJaEFg9" -> (known after apply)
      ~ token = (sensitive value)
    }

  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      ~ body             = "ok" -> (known after apply)
      ~ ca_certificate   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIC5zCCAc+gAwIBAgIBADANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwprdWJl
            cm5ldGVzMB4XDTIxMDgyMjAzMzAzN1oXDTMxMDgyMDAzMzAzN1owFTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAOMO
            eSo2FnXXg4LLt11vOi/DXZ2I7u7uZLFHa38utzLp7xE+rI86HGMovdjF0CU4+nBK
            g31YGBMgHRukhPqVW+GyedPAzJfoKBcO+ttIbplPwedyXzBVz7q+vzmNYDpM4b34
            pI8lXXRU3d97I0hIdcr+23x3N7Wkg+JVWPZX5bKQo7THvKYmHgsOP3SMO0GZpnD+
            Cd1PIMhvuwAg2YoRrsHvko9HRdSufsR7b0uBxyEMceQFXEo5QwOPOr1qG69kCq2X
            K+ImyURgbaa87fg/dzADHWGlQav9ioWzPHxJW3niw3oB04FisiBfeR2CKHfMHrQH
            TqXi7eHW8OGq5PEGkH8CAwEAAaNCMEAwDgYDVR0PAQH/BAQDAgKkMA8GA1UdEwEB
            /wQFMAMBAf8wHQYDVR0OBBYEFJJDiw08MH/Jkh3SSlG7SpjOsN8WMA0GCSqGSIb3
            DQEBCwUAA4IBAQBxm+QVWdnEDfU9kyGuTfoYKJyNxStfego0naa059k03UmBHioD
            DKnZ1MJ60demppwourOiFp/PirjWDUqOYNj0ypeArYnFHHZykyM0q5jmFkvnq+NW
            +ewcFcQxuMDAdTUQK7ez69SV/8AlK2kQtgArWTV/IQNrlaPT5u3ypB5/7EiaRDYi
            3zfd6IueLQ/6Oh5rixizZU6BQq+aHyTSNJt+R2+V/vlYH/PBq7Rp9uSbVrZ9T+gd
            nREYbC/9ca7fE+DkfPix+U/O3e5sW2MvxOanaN6Td070oiahy+trml5FybsQxwnW
            263M1M53J6qBfjdqkKBbTrF6dPhNfG6Csrss
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id               = "https://FCB0A2152642084A5018EBE93CEDF683.gr7.ap-southeast-2.eks.amazonaws.com/healthz" -> (known after apply)
      - insecure         = false -> null
      ~ response_headers = {
          - "Cache-Control"                     = "no-cache, private"
          - "Content-Length"                    = "2"
          - "Content-Type"                      = "text/plain; charset=utf-8"
          - "Date"                              = "Sun, 22 Aug 2021 03:34:49 GMT"
          - "X-Content-Type-Options"            = "nosniff"
          - "X-Kubernetes-Pf-Flowschema-Uid"    = "7709b8f8-97e8-4c4b-9164-a91f8232e98b"
          - "X-Kubernetes-Pf-Prioritylevel-Uid" = "0aa1f4f0-379f-476e-a8e3-787024d4f0f4"
        } -> (known after apply)
      ~ url              = "https://FCB0A2152642084A5018EBE93CEDF683.gr7.ap-southeast-2.eks.amazonaws.com/healthz" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "education-eks-PvJaEFg9-worker-group-120210822033428188600000015"
      ~ launch_configuration      = "education-eks-PvJaEFg9-worker-group-120210822033417686400000013" -> (known after apply)
        name                      = "education-eks-PvJaEFg9-worker-group-120210822033428188600000015"
      ~ vpc_zone_identifier       = [
          + "subnet-00dd6ad17f28e0110",
          + "subnet-073345847327cab44",
          + "subnet-0aff3cd4393d112eb",
            # (3 unchanged elements hidden)
        ]
        # (22 unchanged attributes hidden)

      - tag {
          - key                 = "GithubOrg" -> null
          - propagate_at_launch = true -> null
          - value               = "terraform-aws-modules" -> null
        }
      - tag {
          - key                 = "GithubRepo" -> null
          - propagate_at_launch = true -> null
          - value               = "terraform-aws-eks" -> null
        }
        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "education-eks-PvJaEFg9-worker-group-220210822033428157800000014"
      ~ launch_configuration      = "education-eks-PvJaEFg9-worker-group-220210822033417683300000012" -> (known after apply)
        name                      = "education-eks-PvJaEFg9-worker-group-220210822033428157800000014"
      ~ vpc_zone_identifier       = [
          + "subnet-00dd6ad17f28e0110",
          + "subnet-073345847327cab44",
          + "subnet-0aff3cd4393d112eb",
            # (3 unchanged elements hidden)
        ]
        # (22 unchanged attributes hidden)

      - tag {
          - key                 = "GithubOrg" -> null
          - propagate_at_launch = true -> null
          - value               = "terraform-aws-modules" -> null
        }
      - tag {
          - key                 = "GithubRepo" -> null
          - propagate_at_launch = true -> null
          - value               = "terraform-aws-eks" -> null
        }
        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/education-eks-PvJaEFg9" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNakF6TXpBek4xb1hEVE14TURneU1EQXpNekF6TjFvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBT01PCmVTbzJGblhYZzRMTHQxMXZPaS9EWFoySTd1N3VaTEZIYTM4dXR6THA3eEUrckk4NkhHTW92ZGpGMENVNCtuQksKZzMxWUdCTWdIUnVraFBxVlcrR3llZFBBekpmb0tCY08rdHRJYnBsUHdlZHlYekJWejdxK3Z6bU5ZRHBNNGIzNApwSThsWFhSVTNkOTdJMGhJZGNyKzIzeDNON1drZytKVldQWlg1YktRbzdUSHZLWW1IZ3NPUDNTTU8wR1pwbkQrCkNkMVBJTWh2dXdBZzJZb1Jyc0h2a285SFJkU3Vmc1I3YjB1Qnh5RU1jZVFGWEVvNVF3T1BPcjFxRzY5a0NxMlgKSytJbXlVUmdiYWE4N2ZnL2R6QURIV0dsUWF2OWlvV3pQSHhKVzNuaXczb0IwNEZpc2lCZmVSMkNLSGZNSHJRSApUcVhpN2VIVzhPR3E1UEVHa0g4Q0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZKSkRpdzA4TUgvSmtoM1NTbEc3U3BqT3NOOFdNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCeG0rUVZXZG5FRGZVOWt5R3VUZm9ZS0p5TnhTdGZlZ28wbmFhMDU5azAzVW1CSGlvRApES25aMU1KNjBkZW1wcHdvdXJPaUZwL1BpcmpXRFVxT1lOajB5cGVBclluRkhIWnlreU0wcTVqbUZrdm5xK05XCitld2NGY1F4dU1EQWRUVVFLN2V6NjlTVi84QWxLMmtRdGdBcldUVi9JUU5ybGFQVDV1M3lwQjUvN0VpYVJEWWkKM3pmZDZJdWVMUS82T2g1cml4aXpaVTZCUXErYUh5VFNOSnQrUjIrVi92bFlIL1BCcTdScDl1U2JWclo5VCtnZApuUkVZYkMvOWNhN2ZFK0RrZlBpeCtVL08zZTVzVzJNdnhPYW5hTjZUZDA3MG9pYWh5K3RybWw1Rnlic1F4d25XCjI2M00xTTUzSjZxQmZqZHFrS0JiVHJGNmRQaE5mRzZDc3JzcwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-22 03:25:02.389 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://FCB0A2152642084A5018EBE93CEDF683.gr7.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "education-eks-PvJaEFg9" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/FCB0A2152642084A5018EBE93CEDF683"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "education-eks-PvJaEFg9"
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all                  = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
        # (2 unchanged attributes hidden)

      ~ kubernetes_network_config {
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
        }


      ~ vpc_config {
          ~ cluster_security_group_id = "sg-00eb47d6cac3485fe" -> (known after apply)
          ~ subnet_ids                = [ # forces replacement
              + "subnet-00dd6ad17f28e0110",
              + "subnet-073345847327cab44",
              + "subnet-0aff3cd4393d112eb",
                # (3 unchanged elements hidden)
            ]
          ~ vpc_id                    = "vpc-075b2168a8a54d959" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_iam_instance_profile.workers[0] will be updated in-place
  ~ resource "aws_iam_instance_profile" "workers" {
        id          = "education-eks-PvJaEFg92021082203341736640000000d"
        name        = "education-eks-PvJaEFg92021082203341736640000000d"
      ~ tags        = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all    = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_iam_instance_profile.workers[1] will be updated in-place
  ~ resource "aws_iam_instance_profile" "workers" {
        id          = "education-eks-PvJaEFg92021082203341737680000000e"
        name        = "education-eks-PvJaEFg92021082203341737680000000e"
      ~ tags        = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all    = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be updated in-place
  ~ resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
        id          = "arn:aws:iam::112227029085:policy/education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001"
        name        = "education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001"
      ~ tags        = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all    = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.cluster[0] will be updated in-place
  ~ resource "aws_iam_role" "cluster" {
        id                    = "education-eks-PvJaEFg920210822032427561500000002"
        name                  = "education-eks-PvJaEFg920210822032427561500000002"
      ~ tags                  = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all              = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_iam_role.workers[0] will be updated in-place
  ~ resource "aws_iam_role" "workers" {
        id                    = "education-eks-PvJaEFg92021082203341714260000000c"
        name                  = "education-eks-PvJaEFg92021082203341714260000000c"
      ~ tags                  = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all              = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:6e383f6b-16d9-4284-9422-4c5aeae60ce7:launchConfigurationName/education-eks-PvJaEFg9-worker-group-120210822033417686400000013" -> (known after apply)
      ~ id                               = "education-eks-PvJaEFg9-worker-group-120210822033417686400000013" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "education-eks-PvJaEFg9-worker-group-120210822033417686400000013" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmFrRjZUWHBCZWs0eGIxaEVWRTE0VFVSbmVVMUVRWHBOZWtGNlRqRnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVDAxUENtVlRiekpHYmxoWVp6Uk1USFF4TVhaUGFTOUVXRm95U1RkMU4zVmFURVpJWVRNNGRYUjZUSEEzZUVVcmNrazROa2hIVFc5MlpHcEdNRU5WTkN0dVFrc0taek14V1VkQ1RXZElVblZyYUZCeFZsY3JSM2xsWkZCQmVrcG1iMHRDWTA4cmRIUkpZbkJzVUhkbFpIbFlla0pXZWpkeEszWjZiVTVaUkhCTk5HSXpOQXB3U1Roc1dGaFNWVE5rT1RkSk1HaEpaR055S3pJemVETk9OMWRyWnl0S1ZsZFFXbGcxWWt0UmJ6ZFVTSFpMV1cxSVozTlBVRE5UVFU4d1IxcHdia1FyQ2tOa01WQkpUV2gyZFhkQlp6SlpiMUp5YzBoMmEyODVTRkprVTNWbWMxSTNZakIxUW5oNVJVMWpaVkZHV0VWdk5WRjNUMUJQY2pGeFJ6WTVhME54TWxnS1N5dEpiWGxWVW1kaVlXRTROMlpuTDJSNlFVUklWMGRzVVdGMk9XbHZWM3BRU0hoS1Z6TnVhWGN6YjBJd05FWnBjMmxDWm1WU01rTkxTR1pOU0hKUlNBcFVjVmhwTjJWSVZ6aFBSM0UxVUVWSGEwZzRRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWktTa1JwZHpBNFRVZ3ZTbXRvTTFOVGJFYzNVM0JxVDNOT09GZE5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkNlRzByVVZaWFpHNUZSR1pWT1d0NVIzVlVabTlaUzBwNVRuaFRkR1psWjI4d2JtRmhNRFU1YXpBelZXMUNTR2x2UkFwRVMyNWFNVTFLTmpCa1pXMXdjSGR2ZFhKUGFVWndMMUJwY21wWFJGVnhUMWxPYWpCNWNHVkJjbGx1UmtoSVdubHJlVTB3Y1RWcWJVWnJkbTV4SzA1WENpdGxkMk5HWTFGNGRVMUVRV1JVVlZGTE4yVjZOamxUVmk4NFFXeExNbXRSZEdkQmNsZFVWaTlKVVU1eWJHRlFWRFYxTTNsd1FqVXZOMFZwWVZKRVdXa0tNM3BtWkRaSmRXVk1VUzgyVDJnMWNtbDRhWHBhVlRaQ1VYRXJZVWg1VkZOT1NuUXJVaklyVmk5MmJGbElMMUJDY1RkU2NEbDFVMkpXY2xvNVZDdG5aQXB1VWtWWllrTXZPV05oTjJaRkswUnJabEJwZUN0VkwwOHpaVFZ6VnpKTmRuaFBZVzVoVGpaVVpEQTNNRzlwWVdoNUszUnliV3cxUm5saWMxRjRkMjVYQ2pJMk0wMHhUVFV6U2paeFFtWnFaSEZyUzBKaVZISkdObVJRYUU1bVJ6WkRjM0p6Y3dvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vRkNCMEEyMTUyNjQyMDg0QTUwMThFQkU5M0NFREY2ODMuZ3I3LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ2VkdWNhdGlvbi1la3MtUHZKYUVGZzknCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgdXNlcmRhdGEgY29kZQplY2hvIGZvbyBiYXIK" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:043290cd-74fa-417b-bc51-61e2f5c42f75:launchConfigurationName/education-eks-PvJaEFg9-worker-group-220210822033417683300000012" -> (known after apply)
      ~ id                               = "education-eks-PvJaEFg9-worker-group-220210822033417683300000012" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "education-eks-PvJaEFg9-worker-group-220210822033417683300000012" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmFrRjZUWHBCZWs0eGIxaEVWRTE0VFVSbmVVMUVRWHBOZWtGNlRqRnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVDAxUENtVlRiekpHYmxoWVp6Uk1USFF4TVhaUGFTOUVXRm95U1RkMU4zVmFURVpJWVRNNGRYUjZUSEEzZUVVcmNrazROa2hIVFc5MlpHcEdNRU5WTkN0dVFrc0taek14V1VkQ1RXZElVblZyYUZCeFZsY3JSM2xsWkZCQmVrcG1iMHRDWTA4cmRIUkpZbkJzVUhkbFpIbFlla0pXZWpkeEszWjZiVTVaUkhCTk5HSXpOQXB3U1Roc1dGaFNWVE5rT1RkSk1HaEpaR055S3pJemVETk9OMWRyWnl0S1ZsZFFXbGcxWWt0UmJ6ZFVTSFpMV1cxSVozTlBVRE5UVFU4d1IxcHdia1FyQ2tOa01WQkpUV2gyZFhkQlp6SlpiMUp5YzBoMmEyODVTRkprVTNWbWMxSTNZakIxUW5oNVJVMWpaVkZHV0VWdk5WRjNUMUJQY2pGeFJ6WTVhME54TWxnS1N5dEpiWGxWVW1kaVlXRTROMlpuTDJSNlFVUklWMGRzVVdGMk9XbHZWM3BRU0hoS1Z6TnVhWGN6YjBJd05FWnBjMmxDWm1WU01rTkxTR1pOU0hKUlNBcFVjVmhwTjJWSVZ6aFBSM0UxVUVWSGEwZzRRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWktTa1JwZHpBNFRVZ3ZTbXRvTTFOVGJFYzNVM0JxVDNOT09GZE5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkNlRzByVVZaWFpHNUZSR1pWT1d0NVIzVlVabTlaUzBwNVRuaFRkR1psWjI4d2JtRmhNRFU1YXpBelZXMUNTR2x2UkFwRVMyNWFNVTFLTmpCa1pXMXdjSGR2ZFhKUGFVWndMMUJwY21wWFJGVnhUMWxPYWpCNWNHVkJjbGx1UmtoSVdubHJlVTB3Y1RWcWJVWnJkbTV4SzA1WENpdGxkMk5HWTFGNGRVMUVRV1JVVlZGTE4yVjZOamxUVmk4NFFXeExNbXRSZEdkQmNsZFVWaTlKVVU1eWJHRlFWRFYxTTNsd1FqVXZOMFZwWVZKRVdXa0tNM3BtWkRaSmRXVk1VUzgyVDJnMWNtbDRhWHBhVlRaQ1VYRXJZVWg1VkZOT1NuUXJVaklyVmk5MmJGbElMMUJDY1RkU2NEbDFVMkpXY2xvNVZDdG5aQXB1VWtWWllrTXZPV05oTjJaRkswUnJabEJwZUN0VkwwOHpaVFZ6VnpKTmRuaFBZVzVoVGpaVVpEQTNNRzlwWVdoNUszUnliV3cxUm5saWMxRjRkMjVYQ2pJMk0wMHhUVFV6U2paeFFtWnFaSEZyUzBKaVZISkdObVJRYUU1bVJ6WkRjM0p6Y3dvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vRkNCMEEyMTUyNjQyMDg0QTUwMThFQkU5M0NFREY2ODMuZ3I3LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ2VkdWNhdGlvbi1la3MtUHZKYUVGZzknCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgdXNlcmRhdGEgY29kZQplY2hvIGZvbyBiYXIK" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_security_group.cluster[0] will be updated in-place
  ~ resource "aws_security_group" "cluster" {
        id                     = "sg-0ace5e5f6e3ccd24f"
        name                   = "education-eks-PvJaEFg920210822032448840800000008"
      ~ tags                   = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all               = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.workers[0] will be updated in-place
  ~ resource "aws_security_group" "workers" {
        id                     = "sg-0756b0a6cb6110a30"
        name                   = "education-eks-PvJaEFg920210822032448857200000009"
      ~ tags                   = {
          - "GithubOrg"                                    = "terraform-aws-modules" -> null
          - "GithubRepo"                                   = "terraform-aws-eks" -> null
            # (3 unchanged elements hidden)
        }
      ~ tags_all               = {
          - "GithubOrg"                                    = "terraform-aws-modules" -> null
          - "GithubRepo"                                   = "terraform-aws-eks" -> null
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::112227029085:role/education-eks-PvJaEFg92021082203341714260000000c"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_education-eks-PvJaEFg9"
      + id                   = (known after apply)
    }

Plan: 5 to add, 9 to change, 3 to destroy.

Changes to Outputs:
  ~ cluster_endpoint    = "https://FCB0A2152642084A5018EBE93CEDF683.gr7.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
  ~ cluster_id          = "education-eks-PvJaEFg9" -> (known after apply)
  ~ config_map_aws_auth = [
      ~ {
          ~ id          = "kube-system/aws-auth" -> (known after apply)
          ~ metadata    = [
              ~ {
                  ~ generate_name    = "" -> null
                  ~ generation       = 0 -> (known after apply)
                  ~ resource_version = "622" -> (known after apply)
                  ~ uid              = "bc070df1-425b-4730-be1e-7a0d22233be4" -> (known after apply)
                    # (4 unchanged elements hidden)
                },
            ]
            # (2 unchanged elements hidden)
        },
    ]
  ~ kubectl_config      = <<-EOT
        apiVersion: v1
        preferences: {}
        kind: Config
        
        clusters:
        - cluster:
            server: https://FCB0A2152642084A5018EBE93CEDF683.gr7.ap-southeast-2.eks.amazonaws.com
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNakF6TXpBek4xb1hEVE14TURneU1EQXpNekF6TjFvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBT01PCmVTbzJGblhYZzRMTHQxMXZPaS9EWFoySTd1N3VaTEZIYTM4dXR6THA3eEUrckk4NkhHTW92ZGpGMENVNCtuQksKZzMxWUdCTWdIUnVraFBxVlcrR3llZFBBekpmb0tCY08rdHRJYnBsUHdlZHlYekJWejdxK3Z6bU5ZRHBNNGIzNApwSThsWFhSVTNkOTdJMGhJZGNyKzIzeDNON1drZytKVldQWlg1YktRbzdUSHZLWW1IZ3NPUDNTTU8wR1pwbkQrCkNkMVBJTWh2dXdBZzJZb1Jyc0h2a285SFJkU3Vmc1I3YjB1Qnh5RU1jZVFGWEVvNVF3T1BPcjFxRzY5a0NxMlgKSytJbXlVUmdiYWE4N2ZnL2R6QURIV0dsUWF2OWlvV3pQSHhKVzNuaXczb0IwNEZpc2lCZmVSMkNLSGZNSHJRSApUcVhpN2VIVzhPR3E1UEVHa0g4Q0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZKSkRpdzA4TUgvSmtoM1NTbEc3U3BqT3NOOFdNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCeG0rUVZXZG5FRGZVOWt5R3VUZm9ZS0p5TnhTdGZlZ28wbmFhMDU5azAzVW1CSGlvRApES25aMU1KNjBkZW1wcHdvdXJPaUZwL1BpcmpXRFVxT1lOajB5cGVBclluRkhIWnlreU0wcTVqbUZrdm5xK05XCitld2NGY1F4dU1EQWRUVVFLN2V6NjlTVi84QWxLMmtRdGdBcldUVi9JUU5ybGFQVDV1M3lwQjUvN0VpYVJEWWkKM3pmZDZJdWVMUS82T2g1cml4aXpaVTZCUXErYUh5VFNOSnQrUjIrVi92bFlIL1BCcTdScDl1U2JWclo5VCtnZApuUkVZYkMvOWNhN2ZFK0RrZlBpeCtVL08zZTVzVzJNdnhPYW5hTjZUZDA3MG9pYWh5K3RybWw1Rnlic1F4d25XCjI2M00xTTUzSjZxQmZqZHFrS0JiVHJGNmRQaE5mRzZDc3JzcwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
          name: eks_education-eks-PvJaEFg9
        
        contexts:
        - context:
            cluster: eks_education-eks-PvJaEFg9
            user: eks_education-eks-PvJaEFg9
          name: eks_education-eks-PvJaEFg9
        
        current-context: eks_education-eks-PvJaEFg9
        
        users:
        - name: eks_education-eks-PvJaEFg9
          user:
            exec:
              apiVersion: client.authentication.k8s.io/v1alpha1
              command: aws-iam-authenticator
              args:
                - "token"
                - "-i"
                - "education-eks-PvJaEFg9"
    EOT -> (known after apply)

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*